Repository: fablab-bergamo/FabOMatic-backend
Catalog: src/FabOMatic/translations/*/LC_MESSAGES/messages.po
Languages: it

source: Machines status
it: Stato macchine

source: Real-time machine status dashboard
it: Dashboard di stato macchine in tempo reale

source: Machines
it: Macchine

source: IN USE
it: IN USO

source: FREE
it: LIBERA

source: MAINTENANCE
it: MANUTENZIONE RICHIESTA

source: BLOCKED
it: BLOCCATA

source: OFFLINE
it: FUORI LINEA

source: Add Authorization
it: Aggiungi abilitazione

source: User
it: Utente

source: Machine
it: Macchina

source: Add Intervention
it: Aggiungi intervento

source: Maintenance
it: Manutenzione

source: Add Machine
it: Aggiungi macchina

source: Machine Name
it: Nome macchina

source: Machine Type
it: Tipologia

source: Machine Hours
it: Ore di funzionamento

source: Blocked
it: Bloccata

source: Add Machine Type
it: Aggiungi tipologia

source: Type Name
it: Nome tipologia macchina

source: Auto-logoff delay
it: Log-off automatico dopo

source: (minutes)
it: (minuti)

source: Power-off grace period
it: Spegnimento macchina dopo

source: Access control
it: Verifica abilitazioni

source: Machine need to be authorized for users
it: Le macchine devono essere abilitate specificatamente per l'utente

source: No specific authorization required for users
it: Nessuna verifica abilitazione

source: Submit
it: Conferma

source: Add Maintenance
it: Aggiungi manutenzione

source: Description of maintenance
it: Descrizione operazione

source: Machine to maintain
it: Machina da mantenere

source: Number of use hours to trigger
it: Ore macchina per scatto procedura

source: Add Role
it: Aggiungi ruolo

source: Role Name
it: Nome ruolo

source: Can admin backend
it: Amministratore back-end

source: Can perform maintenance
it: Manutentore macchine

source: Authorize all
it: Autorizza tutto

source: Register manually a machine use
it: Registra manualmente uso macchina

source: Start Timestamp
it: Data-ora inizio

source: End Timestamp
it: Data-ora fine

source: Add User
it: Nuovo utente...

source: Name
it: Nome

source: Surname
it: Cognome

source: Email (required for backend admins)
it: Email (richiesto per accesso backend)

source: Role
it: Ruoli

source: Card UUID
it: Tessera UUID

source: User is disabled
it: Disabilitato?

source: Receive weekly summary emails
it: Ricevi email riepilogo settimanale

source: Users
it: Utenti

source: History
it: Storico

source: Authorizations
it: Abilitazioni

source: Interventions
it: Interventi

source: Roles
it: Ruoli

source: Machine types
it: Tipologie

source: System
it: Sistema

source: Bulk Authorization
it: Abilitazioni massicce

source: Only the checked users will be authorized for the chosen machines. Unselected users will keep their current authorizations.
it: Solo gli utenti selezionati saranno abilitati sulla macchina scelta. Gli Utenti non selezionati manterranno le abilitazioni già esistenti.

source: Select Machine
it: Seleziona macchina

source: Select Users
it: Seleziona utenti

source: Add All users...
it: Abilita tutti gli utenti...

source: Bulk add authorizations
it: Aggiungi abilitazioni massicce

source: Delete Authorization
it: Cancella abilitazione

source: Are you sure you want to delete the authorization for
it: Sei sicuro di volere cancellare l'abilitazione di

source: UserToUse
it: ad usare

source: Yes, delete authorization
it: Sì, cancella abilitazione

source: No, go back
it: No, torna indietro

source: Delete Intervention
it: Cancella intervento

source: Are you sure you want to delete the intervention with ID
it: Sei sicuro di volere cancellare l'intervento con ID

source: Yes, delete intervention
it: Sì, cancella intervento

source: Delete Machine
it: Cancellare macchina

source: Are you sure you want to delete the machine
it: Sei sicuro di volere cancellare la macchina

source: Warning: This action cannot be undone!
it: Attenzione: Questa azione non può essere annullata!

source: The following related records will also be permanently deleted:
it: I seguenti record correlati verranno eliminati permanentemente:

source: board
it: scheda

source: maintenance schedule
it: programma di manutenzione

source: intervention record
it: record di intervento

source: user authorization
it: autorizzazione utente

source: usage record
it: record di utilizzo

source: unknown card record
it: record di carta sconosciuta

source: Yes, delete machine
it: Sì, cancella macchina

source: Delete Machine Type
it: Cancella tipologia

source: Are you sure you want to delete the machine type
it: Sei sicuro di volere cancellare la tipologia di macchine

source: Delete
it: Cancella

source: Delete Maintenance
it: Cancella manutenzione

source: Are you sure you want to delete this maintenance?
it: Sei sicuro di volere cancellare questa manutenzione?

source: Yes, delete maintenance
it: Sì, cancella manutenzione

source: Delete Role
it: Cancella ruolo

source: Are you sure you want to delete the role
it: Sei sicuro di volere cancellare il ruolo

source: Yes, delete role
it: Sì, cancella ruolo

source: Delete history
it: Cancella uso

source: Are you sure you want to delete the use
it: Sei sicuro di volere cancellare l'uso

source: on machine
it: sulla macchina

source: Tick to decrease machine cumulated hours
it: Diminuire le ore macchine di conseguenza?

source: Yes, delete use
it: Sì, cancella uso

source: Delete User
it: Cancella utente

source: Are you sure you want to delete the user
it: Sei sicuro di volere cancellare l'utente

source: Yes, delete user
it: Sì, cancella utente

source: Edit Machine Type
it: Modifica tipologia

source: Machines need to be authorized for user
it: Le macchine richiedono abilitazione specifica

source: No authorization required for machines
it: Nessuna abilitazione richiesta per le macchine

source: Edit Maintenance
it: Modifica manutenzione

source: Description
it: Descrizione

source: Hours Between
it: Periodo in ore

source: URL for instructions
it: URL istruzioni

source: Update Maintenance
it: Aggiorna manutenzione

source: Edit Role
it: Modifica ruolo

source: System reserved
it: Riservato

source: Update Role
it: Aggiorna ruolo

source: This is a web application to manage machines in a Fab Lab environment.
it: Applicativo di gestione parco macchine per Fab Lab

source: Please use single sign-on to access this application
it: Utilizza il single sign-on per accedere a questa applicazione

source: Login with SSO
it: Accedi con SSO

source: Forgot your password?
it: Password dimenticata?

source: or
it: oppure

source: Manage user permissions for machines
it: Gestisci i permessi utente per le macchine

source: Filter Users:
it: Filtra utenti:

source: --Select User--
it: --Seleziona Utente--

source: Filter Machines:
it: Filtra Macchine:

source: --Select Machine--
it: --Seleziona Macchina--

source: Apply Filters
it: Applica Filtri

source: Action
it: Azione

source: Edit
it: Modifica

source: Export table
it: Esporta tabella

source: Track maintenance interventions and repairs
it: Traccia interventi di manutenzione e riparazioni

source: Filter
it: Filtra

source: Timestamp
it: Data-ora

source: Only first 500 records are displayed. Use filters if needed.
it: Solo i primi 500 elementi vengono visualizzati. Usa i filtri se necessario.

source: Configure machines and track maintenance
it: Configura macchine e monitora la manutenzione

source: Machine type
it: Tipologia

source: Last seen
it: Ultimo contatto

source: Actions
it: Azioni

source: EXPIRED
it: SCADUTA

source: hours
it: ore

source: Remote login
it: Login remoto

source: Remote logoff
it: Logoff remoto

source: View history
it: Vedi storico

source: Machine Types
it: Tipologie di macchine

source: Configure machine categories and settings
it: Configura categorie e impostazioni macchine

source: Auto-logoff
it: Log-off automatico dopo

source: Power-off
it: Spegnimento automatico dopo

source: disabled
it: disattivato

source: Maintenances
it: Manutenzioni

source: Schedule and track machine maintenance
it: Programma e monitora la manutenzione macchine

source: Filter Machines
it: Filtra Macchine

source: Filter Description
it: Filtra Descrizione

source: Lcd message
it: Messaggio per display LCD

source: Instructions URL
it: URL istruzioni

source: Define user roles and permissions
it: Definisci ruoli utente e permessi

source: Reserved
it: Riservato

source: Backend admin?
it: Amministratore back-end?

source: Maintainer?
it: Manutentore?

source: Authorize All?
it: Autorizza tutto?

source: System status
it: Stato sistema

source: Monitor and manage system resources
it: Monitora e gestisci le risorse di sistema

source: Database info
it: Database

source: Download DB
it: Scarica database

source: Upload DB
it: Ripristina database

source: System info
it: Info sistema

source: Machine info
it: Informazioni server

source: Reboot system
it: Riavvia host

source: Application info
it: Info applicativo

source: Version installed
it: Versione installata

source: Version available
it: Versione disponibile

source: Update application (pip)
it: Aggiorna applicativo (pip)

source: Restart application
it: Riavvio applicativo

source: Boards list
it: Elenco boards

source: IP address
it: Indirizzo IP

source: FW Version
it: Versione firmware

source: Free heap
it: Heap libero

source: Manage users and RFID card access
it: Gestisci utenti e accesso con carte RFID

source: Password reset
it: Resetta password

source: Time of attempt
it: Ora tentativo

source: Convert to new user
it: Registra come nuovo utente

source: Usage History
it: Storico

source: View and search machine usage records
it: Visualizza e cerca nello storico utilizzo macchine

source: Manual registration
it: Registrazione manuale

source: All Users
it: Tutti gli utenti

source: All Machines
it: Tutte le macchine

source: Start Time
it: Inizio

source: End Time
it: Fine

source: Duration (minutes)
it: Durata (in minuti)

source: Last update
it: Ultimo contatto

source: deleted user
it: Seleziona utenti

source: Still in use
it: Ancora in uso

source: In use
it: In uso

source: FabOMatic - Weekly Summary
it: FabOMatic - Riepilogo Settimanale

source: Hello %(name)s,
it: Ciao %(name)s,

source: Here's the summary of lab activities for last week.
it: Ecco il riepilogo delle attività del laboratorio per la settimana scorsa.

source: Period:
it: Periodo:

source: Overdue by %(hours).1f hours
it: 📊 Utilizzo Macchine

source: No pending maintenance. Great job! 👍
it: ⚠️ Manutenzioni in Sospeso

source: 🔑 Unrecognized Cards
it: 🔑 Tessere Non Riconosciute

source: Note: These cards attempted to access machines but were not recognized. They may need to be registered in the system.
it: Nessun utilizzo di macchine registrato questa settimana.

source: No unrecognized cards this week.
it: Nessuna manutenzione in sospeso. Ottimo lavoro! 👍

source: Visit
it: Visita

source: for more details
it: per maggiori dettagli

source: This is an automated email generated by FabOMatic. Please do not reply.
it: Questa è un'email automatica generata da FabOMatic. Si prega di non rispondere.

source: Password login is disabled. Please use SSO.
it: L'accesso con password è disabilitato. Utilizza SSO.

source: Your user does not have a role with backend administration permission.
it: Il tuo utente non ha i permessi di amministrazione del backend.

source: Wrong username or password.
it: Nome utente o password non validi.

source: You have been logged out.
it: Ti sei scollegato.

source: Email sent with instructions to reset your password.
it: Email inviata con le istruzioni per resettare la tua password

source: No user found with this email.
it: Nessun utente trovato con questa email

source: That is an invalid or expired token
it: Token non valido o scaduto.

source: Your password has been updated! You are now able to log in
it: La tua password è stata aggiornata! Ora puoi fare il log in

source: SSO is not enabled
it: SSO non è abilitato

source: Authentication failed: no email provided
it: Autenticazione fallita: nessuna email fornita

source: No authorized account found for your email. Please contact an administrator.
it: Nessun account autorizzato trovato per la tua email. Contatta un amministratore.

source: Successfully logged in via SSO
it: Accesso effettuato con successo tramite SSO

source: Authentication failed. Please try again or use password login.
it: Autenticazione fallita. Riprova o usa l'accesso con password.

source: Authorization not found
it: Abilitazione non trovata

source: Authorizations added successfully
it: Abilitazioni aggiunte con successo.

source: Intervention not found
it: Interventi

source: Hours must be a positive number.
it: Il campo Ore deve essere un numero positivo

source: Hours must be a number.
it: Il campo Ore deve essere un numero.

source: Machine not found
it: Macchina non trovata.

source: Your user needs a valid CARD ID to use this function
it: Il tuo utente deve avere un ID tessera associato per usare questa funzione.

source: Machine is not online:
it: Macchina non connessa in questo momento.

source: Remote start success
it: Login remoto: successo

source: Remote start failure
it: Login remoto: errore

source: Remote stop success
it: Logoff remoto: successo

source: Remote stop failure
it: Logoff remoto: errore

source: Invalid values for timeout or grace period or access control.
it: Valore scorretto per il periodo di spegnimento o di controllo accessi

source: Invalid values for timeout
it: Valore scorretto per il periodo di auto-logoff.

source: Invalid values for grace period.
it: Valore scorretto per il periodo di spegnimento

source: Machine Type not found
it: Tipologia di macchina non trovata.

source: Machine type deleted successfully.
it: Tipologia di macchina cancellata con successo.

source: Hours between must be a positive number.
it: Il campo Ore deve essere un numero positivo.

source: Hours between must be a number.
it: Il campo Ore deve essere un numero.

source: Maintenance not found
it: Macchina non trovata.

source: Maintenance deleted successfully.
it: Manutenzione cancellata con successo.

source: Role not found.
it: Ruolo non trovato.

source: Cannot edit reserved role.
it: Impossibile modificare ruolo riservato.

source: Role deleted successfully.
it: Ruolo cancellato con successo.

source: File must have sqldb extension
it: Il file deve avere estensione sqldb

source: Database was replaced. Previous copy can be found at
it: Database sostituito. La copia precendete è disponibile in

source: User not found
it: Utente non trovato.

source: An email has been sent with instructions to reset password.
it: Un'e-mail è stato mandata con le istruzioni di re-impostazione password.

source: Invalid card UUID. Please enter either 8 hexadecimal characters or leave it empty.
it: Codice tessera non valido. Usare 8 caratteri esadecimali o lasciare vuoto.

source: Cannot enable weekly summary emails without an email address.
it: Impossibile attivare le email di riepilogo settimanale senza un indirizzo email.

source: You have created a backend admin user without an email address. User will not be able to log on.
it: L'utente amministrativo creato non ha un indirizzo e-mail. Non potrà collegarsi al backend.

source: This card ID is already assigned to another user
it: Questa tessera è già assegnata ad un altro utente

source: Use deleted successfully.
it: Uso cancellato con successo.

source: Invalid start timestamp.
it: Data-ora inizio non valida.

source: End timestamp cannot be before start timestamp.
it: La data-ora fine non può essere anteriore alla data-ora inizio.

source: Machine not found.
it: Macchina non trovata.

source: User not found.
it: Utente non trovato.

source: Registration added successfully.
it: Uso registrato con successo.

source: hour
it: ora

source: minutes
it: minuti

source: minute
it: minuto

source: seconds ago
it: secondi fa

source: second ago
it: secondo fa

source: minutes ago
it: minuti fa

source: minute ago
it: minuto fa

source: hours ago
it: ore fa

source: hour ago
it: ora fa

source: days ago
it: giorni fa

source: day ago
it: giorno fa
